In [19]:
import pandas as pd
import numpy as np

### Removing Duplicates

In [2]:
data = pd.DataFrame({'k1': ['one'] * 3 + ['two'] * 4, 
                     'k2': [1, 1, 2, 2, 3, 3, 4]})
data

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   2
4  two   3
5  two   3
6  two   4

In [3]:
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [4]:
data.drop_duplicates()  # consider all columns if they are all duplicates

    k1  k2
0  one   1
2  one   2
3  two   2
4  two   3
6  two   4

In [5]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   2   3
4  two   3   4
5  two   3   5
6  two   4   6

In [6]:
data.drop_duplicates(['k1'])  # consider one column

    k1  k2  v1
0  one   1   0
3  two   2   3

In [7]:
data.drop_duplicates(['k1', 'k2'])  # consider two columns

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   2   3
4  two   3   4
6  two   4   6

In [10]:
data.drop_duplicates(['k1', 'k2'], keep = 'last')

    k1  k2  v1
1  one   1   1
2  one   2   2
3  two   2   3
5  two   3   5
6  two   4   6

### Transforming Data Using a Function or Mapping

In [12]:
data_1 = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 
                             'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
                    'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data_1

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [15]:
meat_to_animal = { 'bacon': 'pig', 'pulled pork': 'pig', 'pastrami': 'cow', 
                  'corned beef': 'cow', 'honey ham': 'pig', 'nova lox': 'salmon'}

data_1['animal'] = data_1['food'].map(str.lower).map(meat_to_animal)
# or data['food'].map(lambda x: meat_to_animal[x.lower()])

data_1

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### Replacing Values

In [17]:
data_3 = pd.Series([1., -999., 2., -999., -1000., 3.])

In [18]:
data_3

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [22]:
data_3.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [23]:
data_3.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [24]:
data_3.replace({-999: np.nan, -1000: 1})

0    1.0
1    NaN
2    2.0
3    NaN
4    1.0
5    3.0
dtype: float64